[
    {
        "name": "1. The Shawshank Redemption",
        "actors": "Frank Darabont, Stephen King, Frank Darabont, Tim Robbins, Morgan Freeman",
        "rank": 1,
        "description": "A Maine banker convicted of the murder of his wife and her lover in 1947 gradually forms a friendship over a quarter century with a hardened convict, while maintaining his innocence and trying to remain hopeful through simple compassion.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:33.180291",
        "updated_at": "2024-08-05T11:09:33.180295"
    },
    {
        "name": "2. The Godfather",
        "actors": "Francis Ford Coppola, Mario Puzo, Francis Ford Coppola, Marlon Brando, Al Pacino",
        "rank": 2,
        "description": "Don Vito Corleone, head of a mafia family, decides to hand over his empire to his youngest son, Michael. However, his decision unintentionally puts the lives of his loved ones in grave danger.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:34.492284",
        "updated_at": "2024-08-05T11:09:34.492287"
    },
    {
        "name": "3. The Dark Knight",
        "actors": "Christopher Nolan, Jonathan Nolan, Christopher Nolan, David S. Goyer, Christian Bale",
        "rank": 3,
        "description": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman, gordon and harvey dent work to stop the menace",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:36.216025",
        "updated_at": "2024-08-05T11:09:36.216029"
    },
    {
        "name": "4. The Godfather Part II",
        "actors": "Francis Ford Coppola, Francis Ford Coppola, Mario Puzo, Al Pacino, Robert De Niro",
        "rank": 4,
        "description": "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:37.738044",
        "updated_at": "2024-08-05T11:09:37.738048"
    },
    {
        "name": "5. 12 Angry Men",
        "actors": "Sidney Lumet, Reginald Rose, Henry Fonda, Lee J. Cobb, Martin Balsam",
        "rank": 5,
        "description": "The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:39.172290",
        "updated_at": "2024-08-05T11:09:39.172293"
    },
    {
        "name": "6. Schindler's List",
        "actors": "Steven Spielberg, Thomas Keneally, Steven Zaillian, Liam Neeson, Ralph Fiennes",
        "rank": 6,
        "description": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:40.713735",
        "updated_at": "2024-08-05T11:09:40.713738"
    },
    {
        "name": "7. The Lord of the Rings: The Return of the King",
        "actors": "Peter Jackson, J.R.R. Tolkien, Fran Walsh, Philippa Boyens, Elijah Wood",
        "rank": 7,
        "description": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:42.040240",
        "updated_at": "2024-08-05T11:09:42.040244"
    },
    {
        "name": "8. Pulp Fiction",
        "actors": "Quentin Tarantino, Quentin Tarantino, Roger Avary, John Travolta, Uma Thurman",
        "rank": 8,
        "description": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:43.911339",
        "updated_at": "2024-08-05T11:09:43.911342"
    },
    {
        "name": "9. The Lord of the Rings: The Fellowship of the Ring",
        "actors": "Peter Jackson, J.R.R. Tolkien, Fran Walsh, Philippa Boyens, Elijah Wood",
        "rank": 9,
        "description": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:45.245576",
        "updated_at": "2024-08-05T11:09:45.245580"
    },
    {
        "name": "10. The Good, the Bad and the Ugly",
        "actors": "Sergio Leone, Luciano Vincenzoni, Sergio Leone, Agenore Incrocci, Clint Eastwood",
        "rank": 10,
        "description": "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:46.857845",
        "updated_at": "2024-08-05T11:09:46.857848"
    },
    {
        "name": "11. Forrest Gump",
        "actors": "Robert Zemeckis, Winston Groom, Eric Roth, Tom Hanks, Robin Wright",
        "rank": 11,
        "description": "The history of the United States from the 1950s to the '70s unfolds from the perspective of an Alabama man with an IQ of 75, who yearns to be reunited with his childhood sweetheart.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:48.891423",
        "updated_at": "2024-08-05T11:09:48.891426"
    },
    {
        "name": "12. The Lord of the Rings: The Two Towers",
        "actors": "Peter Jackson, J.R.R. Tolkien, Fran Walsh, Philippa Boyens, Elijah Wood",
        "rank": 12,
        "description": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:50.297792",
        "updated_at": "2024-08-05T11:09:50.297795"
    },
    {
        "name": "13. Fight Club",
        "actors": "David Fincher, Chuck Palahniuk, Jim Uhls, Brad Pitt, Edward Norton",
        "rank": 13,
        "description": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:51.735588",
        "updated_at": "2024-08-05T11:09:51.735592"
    },
    {
        "name": "14. Inception",
        "actors": "Christopher Nolan, Christopher Nolan, Leonardo DiCaprio, Joseph Gordon-Levitt, Elliot Page",
        "rank": 14,
        "description": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:53.066696",
        "updated_at": "2024-08-05T11:09:53.066700"
    },
    {
        "name": "15. Star Wars: Episode V - The Empire Strikes Back",
        "actors": "Irvin Kershner, Leigh Brackett, Lawrence Kasdan, George Lucas, Mark Hamill",
        "rank": 15,
        "description": "After the Rebel Alliance are overpowered by the Empire, Luke Skywalker begins his Jedi training with Yoda, while his friends are pursued across the galaxy by Darth Vader and bounty hunter Boba Fett.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:55.317539",
        "updated_at": "2024-08-05T11:09:55.317542"
    },
    {
        "name": "16. The Matrix",
        "actors": "Lana Wachowski, Lilly Wachowski, Lilly Wachowski, Lana Wachowski, Keanu Reeves",
        "rank": 16,
        "description": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:56.630776",
        "updated_at": "2024-08-05T11:09:56.630779"
    },
    {
        "name": "17. GoodFellas",
        "actors": "Martin Scorsese, Nicholas Pileggi, Martin Scorsese, Robert De Niro, Ray Liotta",
        "rank": 17,
        "description": "The story of Henry Hill and his life in the mafia, covering his relationship with his wife Karen and his mob partners Jimmy Conway and Tommy DeVito.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:09:58.646191",
        "updated_at": "2024-08-05T11:09:58.646195"
    },
    {
        "name": "18. One Flew Over the Cuckoo's Nest",
        "actors": "Milos Forman, Lawrence Hauben, Bo Goldman, Ken Kesey, Jack Nicholson",
        "rank": 18,
        "description": "In the Fall of 1963, a Korean War veteran and criminal pleads insanity and is admitted to a mental institution, where he rallies up the scared patients against the tyrannical nurse.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:10:00.154857",
        "updated_at": "2024-08-05T11:10:00.154861"
    },
    {
        "name": "19. Interstellar",
        "actors": "Christopher Nolan, Jonathan Nolan, Christopher Nolan, Matthew McConaughey, Anne Hathaway",
        "rank": 19,
        "description": "When Earth becomes uninhabitable in the future, a farmer and ex-NASA pilot, Joseph Cooper, is tasked to pilot a spacecraft, along with a team of researchers, to find a new planet for humans.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:10:01.938431",
        "updated_at": "2024-08-05T11:10:01.938434"
    },
    {
        "name": "20. Se7en",
        "actors": "David Fincher, Andrew Kevin Walker, Morgan Freeman, Brad Pitt, Kevin Spacey",
        "rank": 20,
        "description": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:10:03.327167",
        "updated_at": "2024-08-05T11:10:03.327170"
    },
    {
        "name": "21. It's a Wonderful Life",
        "actors": "Frank Capra, Frances Goodrich, Albert Hackett, Frank Capra, James Stewart",
        "rank": 21,
        "description": "An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:10:04.980133",
        "updated_at": "2024-08-05T11:10:04.980137"
    },
    {
        "name": "22. Seven Samurai",
        "actors": "Akira Kurosawa, Akira Kurosawa, Shinobu Hashimoto, Hideo Oguni, Toshirô Mifune",
        "rank": 22,
        "description": "Farmers from a village exploited by bandits hire a veteran samurai for protection, who gathers six other samurai to join him.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:10:06.427706",
        "updated_at": "2024-08-05T11:10:06.427708"
    },
    {
        "name": "23. The Silence of the Lambs",
        "actors": "Jonathan Demme, Thomas Harris, Ted Tally, Jodie Foster, Anthony Hopkins",
        "rank": 23,
        "description": "A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:10:07.709806",
        "updated_at": "2024-08-05T11:10:07.709808"
    },
    {
        "name": "24. Saving Private Ryan",
        "actors": "Steven Spielberg, Robert Rodat, Tom Hanks, Matt Damon, Tom Sizemore",
        "rank": 24,
        "description": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:10:09.049352",
        "updated_at": "2024-08-05T11:10:09.049355"
    },
    {
        "name": "25. City of God",
        "actors": "Fernando Meirelles, Kátia Lund, Paulo Lins, Bráulio Mantovani, Alexandre Rodrigues",
        "rank": 25,
        "description": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.",
        "featured_review": "N/A",
        "created_at": "2024-08-05T11:10:10.550209",
        "updated_at": "2024-08-05T11:10:10.550212"
    }
]